cheatsheets/bash-binds.org
:PROPERTIES:
:ID:       95fc3cfe-a41b-4175-b2b0-9a4ed1acff59
:END:
#+TITLE: Bash Binds
#+TAGS:
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes
#+OPTIONS: ':nil *:t -:t ::t <:t \n:nil ^:t arch:headline
#+OPTIONS: author:nil c:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:nil todo:t |:t
#+OPTIONS: toc:nil
#+OPTIONS: html-style:link
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="bash-binds.css" />
# #+BIND: org-html-htmlize-output-type nil
#+SELECT_TAGS:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en

The completion keybinds use mnemonic symbols for each category. =@= for hostname,
=/= pathsep for files, =!= bang for commands. Known hosts won't complete if they are
hashed, which they probably should be. Most of Bash syntax has similar mnemonics
in the syntax for keys & string expansions, but it sounds a bit weird explaining
it.

