cheatsheets/bash-binds.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bash Binds</title>
<meta name="description" content="notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="bash-binds.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bash Binds</h1>
<p>
The completion keybinds use mnemonic symbols for each category. <code>@</code> for hostname,
<code>/</code> pathsep for files, <code>!</code> bang for commands. Known hosts won't complete if they are
hashed, which they probably should be. Most of Bash syntax has similar mnemonics
in the syntax for keys &amp; string expansions, but it sounds a bit weird explaining
it.
</p>
