cheatsheets/bash-binds.org
* Emacs Bindings

#+begin_export html
<pre>
#+end_export

#+begin_verse
 abort *C-g*, *C-x C-g*, *M-C-g*       _digit_                                     _insert_                                   spell-correct-word *C-x s*             
 accept-line *C-j*, *C-m*            ├── argument *M--*                          ├── comment *M-#*                          start-kbd-macro *C-x (*                  
                                 ├── argument *M-0*                          ├── completions *M-**                      tilde-expand *M-&*                       
 _backward_                        ├── argument *M-1*                          └── last-argument *M-.*, *M-_*                                          
 ├── char *C-b*, *<left>*            ├── argument *M-2*                                                                   _transpose_                             
 ├── delete *C-h*                  ├── argument *M-3*                          _kill_                                     ├── chars *C-t*                         
 ├── _kill_                        ├── argument *M-4*                          ├── line *C-k*                             └── words *M-t*                         
 │   ├── line *C-x C-?*            ├── argument *M-5*                          └── word *C-<delete>*, *M-d*                                                       
 │   └── word *M-C-h*              ├── argument *M-6*                                                                   undo *C-_*, *C-x C-u*                      
 └── word *M-b*, *M-<left>*          ├── argument *M-7*                          _next_                                                                           
                                 ├── argument *M-8*                          └── history *C-n*, *M-<down>*                _unix_                                  
 _beginning-of_                    └── argument *M-9*                                                                   ├── line-discard *C-u*                  
 ├── history *M-<*, *<pgup>*                                                   _non-incremental_                          └── word-rubout *C-w*                   
 └── line *C-a*, *<home>*            display-shell-version *C-x C-v*             ├── forward-search-history *M-n*                                                 
                                 downcase-word *M-l*                         └── reverse-search-history *M-p*           upcase-word *M-u*                                   
 call-last-kbd-macro *C-x e*       dynamic-complete-history *M-C-i*                                                                           
 capitalize-word *M-c*             edit-and-execute-command *C-x C-e*          operate-and-get-next *C-o*                 _yank_ *C-y*                                                      
                                                                                                                    ├── last-arg *M-.*, *M-_*                 
 _character-search_ *C-]*            _end_                                       _possible_                                 ├── nth-arg *M-C-y*                     
 └── backward *M-C-] $char*        ├── kbd-macro *C-x )*                       ├── command-completions *C-x!*             └── pop *M-y*                           
                                 └── _of-history_ *M->*, history *M-<pgdown>*    ├── completions *M-*, *M-?*                              
 _clear_                               └── line *C-e*, line *<end>*              ├── filename-completions ~C-x *~                 
 ├── display *M-C-l*                                                         ├── hostname-completions *C-x@*                 
 └── screen *C-l*                  exchange-point-and-mark *C-x C-x*           ├── username-completions *C-x~*                 
                                 execute-named-command *M-x*                 └── variable-completions *C-x$*                 
 _complete_ *C-i*, *<esc> <esc>*                                                                                               
 ├── command *M-!*                 _forward_                                   _previous_                                      
 ├── filename *M-*                 ├── char *C-f*, *M-<right>*                   └── history *C-p*, *M-<up>*                       
 ├── hostname *M-@*                ├── search-history *C-s*                                                                  
 ├── into-braces *M-{*             ├── word *M-f*                              quoted-insert *C-q*, *C-v*, *<insert>*              
 ├── username *M-~*                └── word *M-<right>*                        re-read-init-file *C-x C-r*                      
 └── variable *M-$*                                                          reverse-search-history *C-r*                    
                                 _glob_                                      revert-line *M-C-r*, *M-r*                        
 _delete_                          ├── complete-word *M-g*                     set-mark *C-@*, *M-"*                             
 ├── char *C-d*, *<delete>*          ├── expand-word *C-x**                                                                    
 └── horizontal-space *M-\*        └── list-expansions *C-xg*                  _shell_                                         
                                                                           ├── backward-word *M-C-b*                       
                                 history-expand-line *M-^*                   ├── expand-line *M-C-e*                         
                                                                           ├── forward-word *M-C-f*                        
                                                                           ├── kill-word *M-C-d*                      
                                                                           └── transpose-words *M-C-t*                
#+end_verse

#+begin_export html
</pre>
#+end_export

