cheatsheets/bash-binds.html
<div id="outline-container-org09b54bc" class="outline-2">
<h2 id="org09b54bc">Emacs Bindings</h2>
<div class="outline-text-2" id="text-org09b54bc">
<pre>

<p class="verse">
abort <b>C-g</b>, <b>C-xC-g</b>, <b>M-C-g</b>        <span class="underline">digit</span>                                     <span class="underline">insert</span>                                   spell-correct-word <b>C-x s</b><br />
accept-line <b>C-j</b>, <b>C-m</b>            ├── argument <b>M--</b>                          ├── comment <b>M-#</b>                          start-kbd-macro <b>C-x (</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── argument <b>M-0</b>                          ├── completions <b>M-*</b>                      tilde-expand <b>M-&amp;</b><br />
<span class="underline">backward</span>                        ├── argument <b>M-1</b>                          └── last-argument <b>M-.</b>, <b>M-_</b><br />
├── char <b>C-b</b>, <b>&lt;left&gt;</b>            ├── argument <b>M-2</b>                                                                   <span class="underline">transpose</span><br />
├── delete <b>C-h</b>                  ├── argument <b>M-3</b>                          <span class="underline">kill</span>                                     ├── chars <b>C-t</b><br />
├── <span class="underline">kill</span>                        ├── argument <b>M-4</b>                          ├── line <b>C-k</b>                             └── words <b>M-t</b><br />
│   ├── line <b>C-x C-?</b>            ├── argument <b>M-5</b>                          └── word <b>C-&lt;delete&gt;</b>, <b>M-d</b><br />
│   └── word <b>M-C-h</b>              ├── argument <b>M-6</b>                                                                   undo <b>C-_</b>, <b>C-x C-u</b><br />
└── word <b>M-b</b>, <b>M-&lt;left&gt;</b>          ├── argument <b>M-7</b>                          <span class="underline">next</span><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── argument <b>M-8</b>                          └── history <b>C-n</b>, <b>M-&lt;down&gt;</b>                <span class="underline">unix</span><br />
<span class="underline">beginning-of</span>                    └── argument <b>M-9</b>                                                                   ├── line-discard <b>C-u</b><br />
├── history <b>M-&lt;</b>, <b>&lt;pgup&gt;</b>                                                   <span class="underline">non-incremental</span>                          └── word-rubout <b>C-w</b><br />
└── line <b>C-a</b>, <b>&lt;home&gt;</b>            display-shell-version <b>C-x C-v</b>             ├── forward-search-history <b>M-n</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;downcase-word <b>M-l</b>                         └── reverse-search-history <b>M-p</b>           upcase-word <b>M-u</b><br />
call-last-kbd-macro <b>C-x e</b>       dynamic-complete-history <b>M-C-i</b><br />
capitalize-word <b>M-c</b>             edit-and-execute-command <b>C-x C-e</b>          operate-and-get-next <b>C-o</b>                 <span class="underline">yank</span> <b>C-y</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── last-arg <b>M-.</b>, <b>M-_</b><br />
<span class="underline">character-search</span> <b>C-]</b>            <span class="underline">end</span>                                       <span class="underline">possible</span>                                 ├── nth-arg <b>M-C-y</b><br />
└── backward <b>M-C-] $char</b>        ├── kbd-macro <b>C-x )</b>                       ├── command-completions <b>C-x!</b>             └── pop <b>M-y</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── <span class="underline">of-history</span> <b>M-&gt;</b>, history <b>M-&lt;pgdown&gt;</b>    ├── completions <b>M-</b>, <b>M-?</b><br />
<span class="underline">clear</span>                               └── line <b>C-e</b>, line <b>&lt;end&gt;</b>              ├── filename-completions <code>C-x *</code><br />
├── display <b>M-C-l</b>                                                         ├── hostname-completions <b>C-x@</b><br />
└── screen <b>C-l</b>                  exchange-point-and-mark <b>C-x C-x</b>           ├── username-completions <b>C-x~</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;execute-named-command <b>M-x</b>                 └── variable-completions <b>C-x$</b><br />
<span class="underline">complete</span> <b>C-i</b>, <b>&lt;esc&gt; &lt;esc&gt;</b><br />
├── command <b>M-!</b>                 <span class="underline">forward</span>                                   <span class="underline">previous</span><br />
├── filename <b>M-</b>                 ├── char <b>C-f</b>, <b>M-&lt;right&gt;</b>                   └── history <b>C-p</b>, <b>M-&lt;up&gt;</b><br />
├── hostname <b>M-@</b>                ├── search-history <b>C-s</b><br />
├── into-braces <b>M-{</b>             ├── word <b>M-f</b>                              quoted-insert <b>C-q</b>, <b>C-v</b>, <b>&lt;insert&gt;</b><br />
├── username <b>M-~</b>                └── word <b>M-&lt;right&gt;</b>                        re-read-init-file <b>C-x C-r</b><br />
└── variable <b>M-$</b>                                                          reverse-search-history <b>C-r</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<span class="underline">glob</span>                                      revert-line <b>M-C-r</b>, <b>M-r</b><br />
<span class="underline">delete</span>                          ├── complete-word <b>M-g</b>                     set-mark <b>C-@</b>, <b>M-"</b><br />
├── char <b>C-d</b>, <b>&lt;delete&gt;</b>          ├── expand-word <b>C-x*</b><br />
└── horizontal-space <b>M-\</b>        └── list-expansions <b>C-xg</b>                  <span class="underline">shell</span><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── backward-word <b>M-C-b</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;history-expand-line <b>M-^</b>                   ├── expand-line <b>M-C-e</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── forward-word <b>M-C-f</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── kill-word <b>M-C-d</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── transpose-words <b>M-C-t</b><br />
</p>

</pre>
</div>
</div>
