cheatsheets/bash-binds.org
* Self-Insert

Hitting =C v= or =<insert>= runs =quoted-insert $key= which inserts the escape
sequence for =$key= into the terminal. Running =quoted-insert= on these keys in
sequence enters the following into the terminal. Successive =C v= keybinds seem to
be handled recursively.

|----------+-------+-----+---------+---------+---------+---------+---------+---------|
|          | 000   | 001 | 010     | 011     | 100     | 101     | 110     | 111     |
|          |       |   S | M       | M S     | C       | C S     | C M     | C M S   |
|----------+-------+-----+---------+---------+---------+---------+---------+---------|
| <insert> | =^[[2~= |     | =^[[2;3~= | =^[[2;4~= | =^[[2;5~= | =^[[2;6~= | =^[[2;7~= | =^[[2;8~= |
| C v      | =^v=    |     | =^[V=     |         |         |         |         |         |
|----------+-------+-----+---------+---------+---------+---------+---------+---------|
The terminal application will intercept =C v= before it's given to the window
manager (something like this), so you need to use =C S v= to paste.

In =xkb=, the =shift= modkey causes alphanumeric keybinds to be interpreted as their
raw character codes. =C S v= literally inserts =C V= and =AltGr ;= into =¶=. Thus, I
removed =self-insert= & =do-lowercase-version= binds from this reference.

* Escape Sequences

|----+------+----+--------+-----+--------+------+-------+-------+-------|
| F1 | =^[OP= | F5 | =^[[15~= | F9  | =^[[20~= | home | =^[[H=  | del   | =^[[3~= |
| F2 | =^[OQ= | F6 | =^[[17~= | F10 | =^[[21~= | end  | =^[[F=  | bksp  | =^?=    |
| F3 | =^[OR= | F7 | =^[[18~= | F11 | =^[[23~= | pgup | =^[[5~= | bktab | =^[[Z=  |
| F4 | =^[OS= | F8 | =^[[19~= | F12 | =^[[24~= | pgdn | =^[[6~= | esc   | =^[=    |
|----+------+----+--------+-----+--------+------+-------+-------+-------|
* Quality of Life Keybinds

#+begin_export html
<pre>
#+end_export

#+begin_verse
abort *C-g*                     digit-argument *M [0-9-]*             print-last-kbd-macro
capitalize-word *M-c*           downcase-word *M l*                   quoted-insert *C-v*, *<insert>*
                              dynamic-complete-history *M C i*      undo *C _*
character-search *C ] $char*    edit-and-execute-command *C xC e*     undo *C xC u*
└── backward *M C ] $char*      exchange-point-and-mark *C xC x*      upcase-word *M-u*

complete                      glob                                yank
├── command *M !*               ├── complete-word *M g*               ├── nth-arg *M C y*
├── filename ~M \*~             ├── expand-word *C x*                 └── pop *M y*
├── hostname *M @*              └── list-expansions *C xg*
├── into-braces *M {*
├── username *M ~*              insert
└── variable *M $*              ├── completions *<esc>* ***
                              └── last-argument *M .*, *M _*
#+end_verse

#+begin_export html
</pre>
#+end_export


* Keybind Combos

**** To avoid the strange =unix-word-rubout=

Keybinds involving =C-w= require setting:

=bind '"\C-@":set-mark'=

=bind '"\e ":set-mark'=

=bind '"\C-w":kill-region'=

=bind '"\ew":copy-region-as-kill'=

**** From middle of file or url path  =C-@ M-C ] <space> C-x C-x C-w=

Jump to last space, cut region, leaving the remainder of the path.

Then =C-a varname=value; C-x C-x <right>=

**** From midline =C-@ C-] | C-] | C-x C-x C-w=

Set mark with =C-@=, search forward the next two =|= chars, then
=exchange-point-and-mark= with =C-x C-x=.

This highlights the region. Then =C-w= to cut the text with =kill-region=.

**** From midline ==C-k C-a C-y=

Swap order of commands

**** From midline =C-k C-a C-] | C-] | ... C-y=

cut to end of line, search through line for =|= char and insert the tail of a bash
pipeline. Simply repeating =C-]= doesn't work.

**** From midline =C-a export VAR=value;=

Prefix command with environment var

**** From midline =C-k # C-y=

Kill to end of line, insert =#= and paste. =C-y= to =yank=. Commented command content
is still in history.

**** Running =print-last-keyboard-macro= ...

Shows you what's recorded. You can make composite functions.


