cheatsheets/bash-binds.html
<div id="outline-container-org3fb4601" class="outline-2">
<h2 id="org3fb4601">Self-Insert</h2>
<div class="outline-text-2" id="text-org3fb4601">
<p>
Hitting <code>C v</code> or <code>&lt;insert&gt;</code> runs <code>quoted-insert $key</code> which inserts the escape
sequence for <code>$key</code> into the terminal. Running <code>quoted-insert</code> on these keys in
sequence enters the following into the terminal. Successive <code>C v</code> keybinds seem to
be handled recursively.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">000</th>
<th scope="col" class="org-left">001</th>
<th scope="col" class="org-left">010</th>
<th scope="col" class="org-left">011</th>
<th scope="col" class="org-left">100</th>
<th scope="col" class="org-left">101</th>
<th scope="col" class="org-left">110</th>
<th scope="col" class="org-left">111</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">S</th>
<th scope="col" class="org-left">M</th>
<th scope="col" class="org-left">M S</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">C S</th>
<th scope="col" class="org-left">C M</th>
<th scope="col" class="org-left">C M S</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;insert&gt;</td>
<td class="org-right"><code>^[[2~</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>^[[2;3~</code></td>
<td class="org-left"><code>^[[2;4~</code></td>
<td class="org-left"><code>^[[2;5~</code></td>
<td class="org-left"><code>^[[2;6~</code></td>
<td class="org-left"><code>^[[2;7~</code></td>
<td class="org-left"><code>^[[2;8~</code></td>
</tr>

<tr>
<td class="org-left">C v</td>
<td class="org-right"><code>^v</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>^[V</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
The terminal application will intercept <code>C v</code> before it's given to the window
manager (something like this), so you need to use <code>C S v</code> to paste.
</p>

<p>
In <code>xkb</code>, the <code>shift</code> modkey causes alphanumeric keybinds to be interpreted as their
raw character codes. <code>C S v</code> literally inserts <code>C V</code> and <code>AltGr ;</code> into <code>¶</code>. Thus, I
removed <code>self-insert</code> &amp; <code>do-lowercase-version</code> binds from this reference.
</p>
</div>
</div>
<div id="outline-container-org15b2d19" class="outline-2">
<h2 id="org15b2d19">Escape Sequences</h2>
<div class="outline-text-2" id="text-org15b2d19">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">F1</td>
<td class="org-left"><code>^[OP</code></td>
<td class="org-left">F5</td>
<td class="org-left"><code>^[[15~</code></td>
<td class="org-left">F9</td>
<td class="org-left"><code>^[[20~</code></td>
<td class="org-left">home</td>
<td class="org-left"><code>^[[H</code></td>
<td class="org-left">del</td>
<td class="org-left"><code>^[[3~</code></td>
</tr>

<tr>
<td class="org-left">F2</td>
<td class="org-left"><code>^[OQ</code></td>
<td class="org-left">F6</td>
<td class="org-left"><code>^[[17~</code></td>
<td class="org-left">F10</td>
<td class="org-left"><code>^[[21~</code></td>
<td class="org-left">end</td>
<td class="org-left"><code>^[[F</code></td>
<td class="org-left">bksp</td>
<td class="org-left"><code>^?</code></td>
</tr>

<tr>
<td class="org-left">F3</td>
<td class="org-left"><code>^[OR</code></td>
<td class="org-left">F7</td>
<td class="org-left"><code>^[[18~</code></td>
<td class="org-left">F11</td>
<td class="org-left"><code>^[[23~</code></td>
<td class="org-left">pgup</td>
<td class="org-left"><code>^[[5~</code></td>
<td class="org-left">bktab</td>
<td class="org-left"><code>^[[Z</code></td>
</tr>

<tr>
<td class="org-left">F4</td>
<td class="org-left"><code>^[OS</code></td>
<td class="org-left">F8</td>
<td class="org-left"><code>^[[19~</code></td>
<td class="org-left">F12</td>
<td class="org-left"><code>^[[24~</code></td>
<td class="org-left">pgdn</td>
<td class="org-left"><code>^[[6~</code></td>
<td class="org-left">esc</td>
<td class="org-left"><code>^[</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgea8515a" class="outline-2">
<h2 id="orgea8515a">Quality of Life Keybinds</h2>
<div class="outline-text-2" id="text-orgea8515a">
<pre>

<p class="verse">
abort <b>C-g</b>                     digit-argument <b>M [0-9-]</b>             print-last-kbd-macro<br />
capitalize-word <b>M-c</b>           downcase-word <b>M l</b>                   quoted-insert <b>C-v</b>, <b>&lt;insert&gt;</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;dynamic-complete-history <b>M C i</b>      undo <b>C _</b><br />
character-search <b>C ] $char</b>    edit-and-execute-command <b>C xC e</b>     undo <b>C xC u</b><br />
└── backward <b>M C ] $char</b>      exchange-point-and-mark <b>C xC x</b>      upcase-word <b>M-u</b><br />
<br />
complete                      glob                                yank<br />
├── command <b>M !</b>               ├── complete-word <b>M g</b>               ├── nth-arg <b>M C y</b><br />
├── filename <code>M \*</code>             ├── expand-word <b>C x</b>                 └── pop <b>M y</b><br />
├── hostname <b>M @</b>              └── list-expansions <b>C xg</b><br />
├── into-braces <b>M {</b><br />
├── username <b>M ~</b>              insert<br />
└── variable <b>M $</b>              ├── completions <b>&lt;esc&gt;</b> <b>*</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── last-argument <b>M .</b>, <b>M _</b><br />
</p>

</pre>
</div>
</div>
<div id="outline-container-org920006e" class="outline-2">
<h2 id="org920006e">Keybind Combos</h2>
<div class="outline-text-2" id="text-org920006e">
</div>
<div id="outline-container-org6205eb1" class="outline-5">
<h5 id="org6205eb1">To avoid the strange <code>unix-word-rubout</code></h5>
<div class="outline-text-5" id="text-org6205eb1">
<p>
Keybinds involving <code>C-w</code> require setting:
</p>

<p>
<code>bind '"\C-@":set-mark'</code>
</p>

<p>
<code>bind '"\e ":set-mark'</code>
</p>

<p>
<code>bind '"\C-w":kill-region'</code>
</p>

<p>
<code>bind '"\ew":copy-region-as-kill'</code>
</p>
</div>
</div>
<div id="outline-container-orgf6bdf50" class="outline-5">
<h5 id="orgf6bdf50">From middle of file or url path  <code>C-@ M-C ] &lt;space&gt; C-x C-x C-w</code></h5>
<div class="outline-text-5" id="text-orgf6bdf50">
<p>
Jump to last space, cut region, leaving the remainder of the path.
</p>

<p>
Then <code>C-a varname=value; C-x C-x &lt;right&gt;</code>
</p>
</div>
</div>
<div id="outline-container-org5778588" class="outline-5">
<h5 id="org5778588">From midline <code>C-@ C-] | C-] | C-x C-x C-w</code></h5>
<div class="outline-text-5" id="text-org5778588">
<p>
Set mark with <code>C-@</code>, search forward the next two <code>|</code> chars, then
<code>exchange-point-and-mark</code> with <code>C-x C-x</code>.
</p>

<p>
This highlights the region. Then <code>C-w</code> to cut the text with <code>kill-region</code>.
</p>
</div>
</div>
<div id="outline-container-org79207e3" class="outline-5">
<h5 id="org79207e3">From midline <code>=C-k C-a C-y</code></h5>
<div class="outline-text-5" id="text-org79207e3">
<p>
Swap order of commands
</p>
</div>
</div>
<div id="outline-container-org7480b80" class="outline-5">
<h5 id="org7480b80">From midline <code>C-k C-a C-] | C-] | ... C-y</code></h5>
<div class="outline-text-5" id="text-org7480b80">
<p>
cut to end of line, search through line for <code>|</code> char and insert the tail of a bash
pipeline. Simply repeating <code>C-]</code> doesn't work.
</p>
</div>
</div>
<div id="outline-container-org4795fd9" class="outline-5">
<h5 id="org4795fd9">From midline <code>C-a export VAR=value;</code></h5>
<div class="outline-text-5" id="text-org4795fd9">
<p>
Prefix command with environment var
</p>
</div>
</div>
<div id="outline-container-orgac73af2" class="outline-5">
<h5 id="orgac73af2">From midline <code>C-k # C-y</code></h5>
<div class="outline-text-5" id="text-orgac73af2">
<p>
Kill to end of line, insert <code>#</code> and paste. <code>C-y</code> to <code>yank</code>. Commented command content
is still in history.
</p>
</div>
</div>
<div id="outline-container-orgc3b7096" class="outline-5">
<h5 id="orgc3b7096">Running <code>print-last-keyboard-macro</code> &#x2026;</h5>
<div class="outline-text-5" id="text-orgc3b7096">
<p>
Shows you what's recorded. You can make composite functions.
</p>
</div>
</div>
</div>
