cheatsheets/bash-binds.org
* Unmapped by default

#+begin_export html
<pre>
#+end_export

#+begin_verse
alias-expand-line     _dump_                          _kill_                               _previous_                    
arrow-key-prefix      ├── functions                 ├── region                         └── screen-line               
                      ├── macros                    └── whole-line                                                   
_backward_              └── variables                                                    print-last-kbd-macro          
└── byte                                            magic-space                        redraw-current-line           
                      emacs-editing-mode                                                                             
bash-vi-complete      export-completions            _menu_                               _shell_                         
                      fetch-history                 ├── complete                       └── backward-kill-word        
_copy_                                                └── complete-backward                                            
├── backward-word     _forward_                                                          skip-csi-sequence             
├── forward-word      ├── backward-delete-char      _next_                               tab-insert                    
└── region-as-kill    └── byte                      └── screen-line                    tty-status                    
                                                                                       universal-argument            
dabbrev-expand        _history_                       _non-incremental_
                      ├── and-alias-expand-line     ├── forward-search-history-again   _unix_
_delete_                ├── search-backward           └── reverse-search-history-again   └── filename-rubout
└── char-or-list      ├── search-forward
                      └── substring                 old-menu-complete
                          ├── search-backward       overwrite-mode
                          └── search-forward
#+end_verse

#+begin_export html
</pre><br><br><br>
#+end_export

* Vi Bindings

#+begin_example
For vi bindings ... you're on your own.
#+end_example

#+begin_export html
<pre>
#+end_export

#+begin_verse
*vi*                  *vi*                           *vi*                       *vi*
├── append          ├── char-search              ├── forward              ├── redo
│   ├── eol         ├── column                   │   ├── bigword          ├── replace
│   └── mode        ├── complete                 │   └── word             ├── rubout
├── arg-digit       ├── delete-to                ├── fword                ├── search-again
├── back-to-indent  ├── edit-and-execute-command ├── fWord                ├── set-mark
├── backward        ├── editing-mode             ├── goto-mark            ├── subst
│   ├── bigword     ├── end                      ├── insert-beg           ├── tilde-expand
│   └── word        │   ├── bigword              ├── insertion-mode       ├── undo
├── bword           │   └── word                 ├── match                ├── unix-word-rubout
├── bWord           ├── eof-maybe                ├── movement-mode        └── yank
└── change          ├── eword                    ├── next-word                ├── arg
    ├── case        ├── eWord                    ├── overstrike-delete        ├── pop
    ├── char        ├── fetch-history            ├── prev-word                └── to
    └── to          └── first-print              └── put
#+end_verse

#+begin_export html
</pre>
#+end_export


* noexport :noexport:

I really can't do this correctly twice. difficult to keep track of state & i
haven't used vi bindings much in bash. =set -o vi= doesn't seem to set much by
default

#+begin_src css :tangle bash-binds.css
/* org reset --------------------------------------------- */
body { font-size: 0.9em; margin: 0.1em; padding: 0em }
p { font-size: 0.9em; }
th { background-color: seagreen; color: #F6F6F6; }
table { border: 1px solid darkgreen; border-radius: 3px; }
th,td { border: 1px solid darkgreen; padding: 0.2em; font-size: 0.9em; }
#content { max-width: 100% !important }
code { color: indigo; }
h1,h2,h3,h4,h5 { margin: 0.2em; padding: 0.1em}
ul,ol { margin: 0.1em; }

dd { margin: 0.1em 2em; }
li { margin: 0.1em;font-size: 0.9em; }

/* cheatsheet --------------------------------------------- */
table { display: table; margin: auto; }
pre { background: inherit; border: none; padding: 0.2em; margin: 0.2em auto; display:table; }
h2 { color: darkblue; font-size: 1.1em; line-height: 1.1em; text-align: center; margin: 0.2em auto; }
h5 { color: darkgreen; line-height: 1.1em; margin: 0.1em auto; }
p { margin: 0.1em }

/* this rule is needed twice for some reason */
p.verse b { color: darkgreen !important; }
p.verse b { color: darkgreen; }
p.verse i { color: darkblue !important; }
p.verse span.underline { color: maroon !important; }  /* font-weight: 550; */
/* p.verse b { color: darkgreen; } */
p.verse { font-family: monospace; line-height: 0.7em; padding: 0; margin: 0.2em}; }
#+end_src

** Extracting

#+begin_src shell
set -o emacs
alias bashbinds2="bind -p \
    | tr -d ':\"' \
    | sed -e 's/^# /#/g/ \
    | sed -e 's/ (not bound)//g' \
    | sed -e 's/\\\\e/M /g' \
    | sed -e 's/\\\\C-/C /g' \
    | grep -v 'self-insert'"

# dear god that's messy

# paste <(bashbinds2 | rev | cut -f1 -d' ' | rev) \
#     <(bashbinds2 | rev | cut -f2- -d' ' | rev) \
#     | sed -E 's/\s+#.*//g' | sed -E 's/^#//g'

# paste <(bashbinds2 | rev | cut -f1 -d' ' | tr '-' '/' | rev | sed -E 's/$/\//g') \
#     <(bashbinds2 | rev | cut -f2- -d' ' | rev) \
#     | sed -E 's/\s+#.*//g' | sed -E 's/^#//g' \
#     | tree --noreport --fromfile .

# still requires some manual cleanup
paste <(bashbinds2 | rev | cut -f1 -d' ' | tr '-' '/' | rev | sed -E 's/$/\//g') \
    <(bashbinds2 | rev | cut -f2- -d' ' | rev) \
    | sed -E 's/\s+#.*//g' | sed -E 's/^#//g' | tr -d '  ' \
    | tree --noreport --fromfile .
#+end_src

still requires some manual cleanup

+ replace =[5A= with =<right>=, delete similar
+ replace =[5B= with =<up>=, delete similar
+ replace =[5C= with =<right>=, delete similar
+ replace =[5D= with =<left>=, delete similar


** xkb

Without additional =xkb= levels, =A AltGr $key= will insert chars into
=alacritty= that cause application panic

#+begin_example text
The application panicked (crashed).
Message:  called `Result::unwrap()` on an `Err` value: "\x9F"
Location: library/std/src/env.rs:871
#+end_example

