cheatsheets/bash-binds.html
<div id="outline-container-orgcf18b52" class="outline-2">
<h2 id="orgcf18b52">Unmapped by default</h2>
<div class="outline-text-2" id="text-orgcf18b52">
<pre>

<p class="verse">
alias-expand-line     <span class="underline">dump</span>                          <span class="underline">kill</span>                               <span class="underline">previous</span><br />
arrow-key-prefix      ├── functions                 ├── region                         └── screen-line<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── macros                    └── whole-line<br />
<span class="underline">backward</span>              └── variables                                                    print-last-kbd-macro<br />
└── byte                                            magic-space                        redraw-current-line<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;emacs-editing-mode<br />
bash-vi-complete      export-completions            <span class="underline">menu</span>                               <span class="underline">shell</span><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;fetch-history                 ├── complete                       └── backward-kill-word<br />
<span class="underline">copy</span>                                                └── complete-backward<br />
├── backward-word     <span class="underline">forward</span>                                                          skip-csi-sequence<br />
├── forward-word      ├── backward-delete-char      <span class="underline">next</span>                               tab-insert<br />
└── region-as-kill    └── byte                      └── screen-line                    tty-status<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;universal-argument<br />
dabbrev-expand        <span class="underline">history</span>                       <span class="underline">non-incremental</span><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── and-alias-expand-line     ├── forward-search-history-again   <span class="underline">unix</span><br />
<span class="underline">delete</span>                ├── search-backward           └── reverse-search-history-again   └── filename-rubout<br />
└── char-or-list      ├── search-forward<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── substring                 old-menu-complete<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;├── search-backward       overwrite-mode<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;└── search-forward<br />
</p>

</pre><br><br><br>
</div>
</div>
<div id="outline-container-orgc6d51a5" class="outline-2">
<h2 id="orgc6d51a5">Vi Bindings</h2>
<div class="outline-text-2" id="text-orgc6d51a5">
<pre class="example" id="org0bba0ef">
For vi bindings ... you're on your own.
</pre>

<pre>

<p class="verse">
<b>vi</b>                  <b>vi</b>                           <b>vi</b>                       <b>vi</b><br />
├── append          ├── char-search              ├── forward              ├── redo<br />
│   ├── eol         ├── column                   │   ├── bigword          ├── replace<br />
│   └── mode        ├── complete                 │   └── word             ├── rubout<br />
├── arg-digit       ├── delete-to                ├── fword                ├── search-again<br />
├── back-to-indent  ├── edit-and-execute-command ├── fWord                ├── set-mark<br />
├── backward        ├── editing-mode             ├── goto-mark            ├── subst<br />
│   ├── bigword     ├── end                      ├── insert-beg           ├── tilde-expand<br />
│   └── word        │   ├── bigword              ├── insertion-mode       ├── undo<br />
├── bword           │   └── word                 ├── match                ├── unix-word-rubout<br />
├── bWord           ├── eof-maybe                ├── movement-mode        └── yank<br />
└── change          ├── eword                    ├── next-word                ├── arg<br />
&#xa0;   ├── case        ├── eWord                    ├── overstrike-delete        ├── pop<br />
&#xa0;   ├── char        ├── fetch-history            ├── prev-word                └── to<br />
&#xa0;   └── to          └── first-print              └── put<br />
</p>

</pre>
</div>
</div>
</div>
</body>
</html>
